# Шрифт Брайля
#
# Сделать перевод кириллицы на шрифт
# Подключить бд
# Предложить сохранить в файл
# Сделать парсер для шрифта
# 


alphabet = {"а":"\u2801", "б":"\u2803", "в":"\u283A", "г":"\u281B ", "д":"\u2819", "е":"\u2811", "ё":"\u2821", "ж":"\u281A", "з":"\u2835", "и":"\u280A", "й":"\u282F", "к":"\u2805", "л":"\u2807", "м":"\u280D", "н":"\u281D", "о":"\u2815", "п":"\u280F", "р":"\u2817", "с":"\u280E", "т":"\u281E", "у":"\u2825", "ф":"\u280B", "х":"\u2813", "ц":"\u2809", "ч":"\u281F", "ш":"\u2831", "щ":"\u282D", "ъ":"\u2837", "ы":"\u282E", "ь":"\u283E", "э":"\u282A", "ю":"\u2833", "я":"\u282B"}


text = input("Enter your text: ")
character_spisok = list(text.lower())

for ch in character_spisok:
    if ch != " ":
        a = alphabet[ch]
        print(a.encode().decode(), end="")
    else:
        print("  ", end="")